/** Sheet3(金融資産保有額の分布)のBar/Pieチャートで共通利用するexcludeHeaders */
export const SHEET3_EXCLUDE_HEADERS = [
  "％ | （150万円以上）", // nullデータ
  "平均 | 万円", // 金額データ
  "中央値 | 万円", // 金額データ
];

/** Sheet3(金融資産保有額の分布)のBar/Pieチャートで共通利用するラベルマッピング */
export const SHEET3_LABEL_MAP: Record<string, string> = {
  "100 | 万円 | 未満 | ％": "100万円未満",
  "100 | ～ | 200 | 万円 未満 | (100～ 150万円未満)": "100～200万円未満",
  "200 | ～ | 300 | 万円 未満 | ％": "200～300万円未満",
  "300 | ～ | 400 | 万円 未満 | ％": "300～400万円未満",
  "400 | ～ | 500 | 万円 未満 | ％": "400～500万円未満",
  "500 | ～ | 700 | 万円 未満 | ％": "500～700万円未満",
  "700 | ～ | 1000 | 万円 未満 | ％": "700～1000万円未満",
  "1000 | ～ | 1500 | 万円 未満 | ％": "1000～1500万円未満",
  "1500 | ～ | 2000 | 万円 未満 | ％": "1500～2000万円未満",
  "2000 | ～ | 3000 | 万円 未満 | ％": "2000～3000万円未満",
  "3000 | 万円 | 以上 | ％": "3000万円以上",
};
